stress/setting/POST.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 1
scenarios: 
  - flow:
      - post:
          url: "http://localhost:4000/settings/edit/601f05acbfa08b5d957a3bdc"
          json:
              receiveNotifications: false
              preferredTheme: "dark"
          expect:
            statusCode: 200