stress/setting/POST_2.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 1
scenarios: 
  - flow:
      - post:
          url: "http://localhost:4000/settings/add/"
          json:
                receiveNotifications: true
                preferredTheme: "light"
          expect:
            statusCode: 200